Catalogs/ФайлыЛекс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>ФайлыЛекс</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПрисоединенныхФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецФайла</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СлужебнаяЗаписка</v8:Type>
						<v8:Type>cfg:BusinessProcessRef.Задание</v8:Type>
						<v8:Type>cfg:DocumentRef.Замер</v8:Type>
						<v8:Type>cfg:CatalogRef.ПапкиФайлов</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:DocumentRef.Спецификация</v8:Type>
						<v8:Type>cfg:CatalogRef.КаталогИзделий</v8:Type>
						<v8:Type>cfg:CatalogRef.УчебныеЗанятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пиктограмма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хэш</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВидыПрисоединенныхФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>ВидыПрисоединенныхФайлов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БытоваяТехника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВекторныйФайл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзрывСхемаЛевая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзрывСхемаОсновная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзрывСхемаПравая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамерныйЛист</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КартинкаЛевая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КартинкаПравая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КрышаЛевая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КрышаПравая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Логотип</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Макет3D</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МонтажнаяСхема</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсновнаяКартинка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СистемныйФайл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СканДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТекстураНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФотоЗамера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦеховаяСхема</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Эскиз</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ФайлыЛекс/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОбновитьИзФайла(Команда)
		
	СтруктураФайла = ЛексКлиент.ВыбратьФайл(ЭтаФорма);
	
	Если ТипЗнч(СтруктураФайла) = Тип("Структура") Тогда
		
		ОбновитьФайл(Объект.Ссылка, СтруктураФайла);
		Прочитать();

	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьФайл(ФайлСсылка, СтруктураФайла)
	
	Файл = ФайлСсылка.ПолучитьОбъект();
	
	Файл.Наименование = СтруктураФайла.Наименование;
	Файл.Данные = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(СтруктураФайла.АдресВременногоХранилищаФайла));
	Файл.Дата = СтруктураФайла.Дата;
	Файл.Размер = СтруктураФайла.Размер;
	Файл.Автор = СтруктураФайла.Автор;
	Файл.Хэш = ЛексСервер.ПолучитьХэшСумму(Файл.Данные.Получить());
	Файл.Расширение = СтруктураФайла.Расширение;
	Файл.Пиктограмма = СтруктураФайла.Пиктограмма;
	
	Файл.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура Посмотреть(Команда)
	
	ЛексКлиент.ОткрытьФайл(Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Перем Ошибки;
	
	Если НЕ ЗначениеЗаполнено(Объект.Вид) Тогда		
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.Вид", "Заполните поле ""Вид""");	
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Предопределенный Тогда
		Элементы.Владелец.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
	ЗаполнитьВидыФайла();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВидыФайла()
			
	МассивДоступныхВидовФайла = Новый Массив;
	
	Если ЗначениеЗаполнено(Объект.ВладелецФайла) Тогда
	
		ТипВладельца = ТипЗнч(Объект.ВладелецФайла);
	
		Если ТипВладельца = Тип("ДокументСсылка.Спецификация") Тогда
			
			МассивДоступныхВидовФайла.Добавить(Перечисления.ВидыПрисоединенныхФайлов.Эскиз);
			МассивДоступныхВидовФайла.Добавить(Перечисления.ВидыПрисоединенныхФайлов.Макет3D);
			МассивДоступныхВидовФайла.Добавить(Перечисления.ВидыПрисоединенныхФайлов.МонтажнаяСхема);
			МассивДоступныхВидовФайла.Добавить(Перечисления.ВидыПрисоединенныхФайлов.ЦеховаяСхема);
			МассивДоступныхВидовФайла.Добавить(Перечисления.ВидыПрисоединенныхФайлов.ЗамерныйЛист);
			
		ИначеЕсли ТипВладельца = Тип("ДокументСсылка.Замер") Тогда
			
			МассивДоступныхВидовФайла.Добавить(Перечисления.ВидыПрисоединенныхФайлов.ЗамерныйЛист);
			МассивДоступныхВидовФайла.Добавить(Перечисления.ВидыПрисоединенныхФайлов.ФотоЗамера);
			МассивДоступныхВидовФайла.Добавить(Перечисления.ВидыПрисоединенныхФайлов.БытоваяТехника);

		ИначеЕсли ТипВладельца = Тип("СправочникСсылка.Номенклатура") Тогда
			
			МассивДоступныхВидовФайла.Добавить(Перечисления.ВидыПрисоединенныхФайлов.ТекстураНоменклатуры);
			МассивДоступныхВидовФайла.Добавить(Перечисления.ВидыПрисоединенныхФайлов.ВекторныйФайл);
			
		ИначеЕсли ТипВладельца = Тип("ДокументСсылка.СлужебнаяЗаписка") Тогда
			
			МассивДоступныхВидовФайла.Добавить(Перечисления.ВидыПрисоединенныхФайлов.СканДокумента);
			
		ИначеЕсли ТипВладельца = Тип("СправочникСсылка.КаталогИзделий") Тогда
			
			МассивДоступныхВидовФайла.Добавить(Перечисления.ВидыПрисоединенныхФайлов.ОсновнаяКартинка);
			МассивДоступныхВидовФайла.Добавить(Перечисления.ВидыПрисоединенныхФайлов.КартинкаЛевая);
			МассивДоступныхВидовФайла.Добавить(Перечисления.ВидыПрисоединенныхФайлов.КартинкаПравая);
			МассивДоступныхВидовФайла.Добавить(Перечисления.ВидыПрисоединенныхФайлов.Макет3D);
			МассивДоступныхВидовФайла.Добавить(Перечисления.ВидыПрисоединенныхФайлов.ЦеховаяСхема);
			МассивДоступныхВидовФайла.Добавить(Перечисления.ВидыПрисоединенныхФайлов.МонтажнаяСхема);
			МассивДоступныхВидовФайла.Добавить(Перечисления.ВидыПрисоединенныхФайлов.КрышаЛевая);
			МассивДоступныхВидовФайла.Добавить(Перечисления.ВидыПрисоединенныхФайлов.КрышаПравая);
			МассивДоступныхВидовФайла.Добавить(Перечисления.ВидыПрисоединенныхФайлов.ВзрывСхемаЛевая);
			МассивДоступныхВидовФайла.Добавить(Перечисления.ВидыПрисоединенныхФайлов.ВзрывСхемаОсновная);
			МассивДоступныхВидовФайла.Добавить(Перечисления.ВидыПрисоединенныхФайлов.ВзрывСхемаПравая);
			
		ИначеЕсли ТипВладельца = Тип("СправочникСсылка.Контрагенты") Тогда
			
			МассивДоступныхВидовФайла.Добавить(Перечисления.ВидыПрисоединенныхФайлов.Логотип);	
			
		КонецЕсли;
		
	Иначе
		
		МассивДоступныхВидовФайла.Добавить(Перечисления.ВидыПрисоединенныхФайлов.СистемныйФайл);
		
	КонецЕсли;
	
	Если МассивДоступныхВидовФайла.Количество() > 0 Тогда
		
		Элементы.Вид.СписокВыбора.Очистить();
		Элементы.Вид.СписокВыбора.ЗагрузитьЗначения(МассивДоступныхВидовФайла);
		
	Иначе
		
		Элементы.Вид.РежимВыбораИзСписка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.Вид = Перечисления.ВидыПрисоединенныхФайлов.Логотип
		И ТипЗнч(ТекущийОбъект.ВладелецФайла) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		ВладелецОб = ТекущийОбъект.ВладелецФайла.ПолучитьОбъект();
		ВладелецОб.Логотип = Объект.Ссылка;
		ВладелецОб.Записать();
		
	КонецЕсли;
	
КонецПроцедуры
